
## Plan Result (tiny_virtual_machines)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 6 to change, 4 to destroy.</code></pre>

* Update
  * module.tiny_k8s_virtual_machines[&#34;hela-tiny-master0&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;hela-tiny-node0&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;loki-tiny-master1&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;loki-tiny-node1&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;thor-tiny-master2&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;thor-tiny-node2&#34;].proxmox_virtual_environment_vm.vm
* Replace
  * proxmox_virtual_environment_download_file.tiny_images[&#34;hela-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;loki-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;thor-jammy-server-cloudimg-amd64.img&#34;]
  * terraform_data.k8s_ansible[&#34;tiny&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # proxmox_virtual_environment_download_file.tiny_images["hela-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 669099008 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.tiny_images["loki-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 669099008 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.tiny_images["thor-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 669099008 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # terraform_data.k8s_ansible["tiny"] must be replaced
-/+ resource "terraform_data" "k8s_ansible" {
      ~ id               = "a77fd575-dfb6-8f78-e17d-e9e0f02acdca" -> (known after apply)
      ~ triggers_replace = [
            # (2 unchanged elements hidden)
            {
                hela-tiny-master0 = {
                    primary_mac_address = "BC:24:11:22:1C:50"
                }
                hela-tiny-node0   = {
                    primary_mac_address = "BC:24:11:91:B7:DC"
                }
                loki-tiny-master1 = {
                    primary_mac_address = "BC:24:11:22:E4:A3"
                }
                loki-tiny-node1   = {
                    primary_mac_address = "BC:24:11:DE:E9:1B"
                }
                thor-tiny-master2 = {
                    primary_mac_address = "BC:24:11:8D:F5:D1"
                }
                thor-tiny-node2   = {
                    primary_mac_address = "BC:24:11:90:65:2A"
                }
            },
          ~ <<-EOT
                - name: Prepare and install K3S
                  vars:
                    passed_hosts: wanda_k3s_cluster
                    k3s_version: "v1.32.4+k3s1"
                    run_prep: true
                    run_install: false
                  hosts: "{{ passed_hosts }}"
                  become: true
                  become_user: root
                  become_method: sudo
                  pre_tasks:
              -     - name: Set master nodes to be a control node
              -       ansible.builtin.set_fact:
              -         k3s_control_node: true
              -       when: "'master' in inventory_hostname"
              -     - name: Add node-ip to k3s_server conf
              -       ansible.builtin.set_fact:
              -         k3s_server: "{{ k3s_server | combine({ 'node-ip': ansible_host}) }}"
              +   - name: Set cluster_name
              +     ansible.builtin.set_fact:
              +       cluster_name: "{{ inventory_hostname.split('_')[0] }}"
              +   - name: Set master nodes to be a control node
              +     ansible.builtin.set_fact:
              +       k3s_control_node: true
              +     when: "'master' in inventory_hostname"
              +   - name: Add node-ip to k3s_server conf
              +     ansible.builtin.set_fact:
              +       k3s_server: "{{ k3s_server | combine({ 'node-ip': ansible_host}) }}"
                  tasks:
              -     - name: K3S Prepare
              -       when: run_prep
              -       ansible.builtin.include_role:
              -         name: prep
              -     - name: Install K3S
              -       when: run_install
              -       ansible.builtin.include_role:
              -         name: xanmanning.k3s
              -         public: true
              -       vars:
              -         k3s_release_version: "{{ k3s_version }}"
              -         k3s_install_hard_links: true
              -         k3s_become: true
              -         k3s_server_manifests_templates:
              -           - coredns-custom.yaml
              -     - name: Resource Readiness Check
              -       run_once: true
              -       kubernetes.core.k8s_info:
              -         kubeconfig: /etc/rancher/k3s/k3s.yaml
              -         kind: "{{ item.kind }}"
              -         name: "{{ item.name }}"
              -         namespace: "{{ item.namespace | default('') }}"
              -         wait: true
              -         wait_sleep: 10
              -         wait_timeout: 360
              -       loop:
              -         - kind: ConfigMap
              -           name: coredns-custom
              -           namespace: kube-system
              -       register: resource_check
              -       when:
              -         - k3s_server_manifests_templates | length > 0
              -             or k3s_server_manifests_urls | length > 0
              -         - k3s_control_node is defined
              -         - k3s_control_node
              -     - name: Remove deployed manifest templates
              -       ansible.builtin.file:
              -         path: "{{ k3s_server_manifests_dir }}/{{ item | basename |
              -           regex_replace('\\.j2$', '') }}"
              -         state: absent
              -       loop: "{{ k3s_server_manifests_templates | default([]) }}"
              -     - name: Remove deployed manifest urls
              -       ansible.builtin.file:
              -         path: "{{ k3s_server_manifests_dir }}/{{ item.filename }}"
              -         state: absent
              -       loop: "{{ k3s_server_manifests_urls | default([]) }}"
              +   - name: K3S Prepare
              +     when: run_prep
              +     ansible.builtin.include_role:
              +       name: prep
              +   - name: Install K3S
              +     when: run_install
              +     ansible.builtin.include_role:
              +       name: xanmanning.k3s
              +       public: true
              +     vars:
              +       k3s_release_version: "{{ k3s_version }}"
              +       k3s_install_hard_links: true
              +       k3s_become: true
              +       k3s_server_manifests_templates:
              +       - coredns-custom.yaml
              +   - name: Resource Readiness Check
              +     run_once: true
              +     kubernetes.core.k8s_info:
              +       kubeconfig: /etc/rancher/k3s/k3s.yaml
              +       kind: "{{ item.kind }}"
              +       name: "{{ item.name }}"
              +       namespace: "{{ item.namespace | default('') }}"
              +       wait: true
              +       wait_sleep: 10
              +       wait_timeout: 360
              +     loop:
              +     - kind: ConfigMap
              +       name: coredns-custom
              +       namespace: kube-system
              +     register: resource_check
              +     when:
              +     - run_install
              +     - k3s_server_manifests_templates | length > 0 or k3s_server_manifests_urls | length > 0
              +     - k3s_control_node is defined
              +     - k3s_control_node
              +   - name: Remove deployed manifest templates
              +     ansible.builtin.file:
              +       path: "{{ k3s_server_manifests_dir }}/{{ item | basename | regex_replace('\\.j2$', '') }}"
              +       state: absent
              +     loop: "{{ k3s_server_manifests_templates | default([]) }}"
              +     when: run_install
              +   - name: Remove deployed manifest urls
              +     ansible.builtin.file:
              +       path: "{{ k3s_server_manifests_dir }}/{{ item.filename }}"
              +       state: absent
              +     loop: "{{ k3s_server_manifests_urls | default([]) }}"
              +     when: run_install
              +   - name: Check if Cilium is installed
              +     run_once: true
              +     kubernetes.core.k8s_info:
              +       kubeconfig: /etc/rancher/k3s/k3s.yaml
              +       kind: Deployment
              +       name: cilium-operator
              +       namespace: kube-system
              +     register: cilium_check
              +     when: run_install
              +   - name: Set k8s_service_host
              +     run_once: true
              +     ansible.builtin.set_fact:
              +       k8s_service_host: "{{ k3s_server['tls-san'] }}"
              +     when: k3s_server['tls-san'] is defined
              +     delegate_to: localhost
              +   - name: Set single_control_plane_name
              +     run_once: true
              +     ansible.builtin.set_fact:
              +       single_control_plane_name: "{{ hostvars.keys() | select('search', 'master') | select('search', cluster_name) | first }}"
              +     when: k3s_server['tls-san'] is not defined
              +     delegate_to: localhost
              +   - name: Set k8s_service_host
              +     run_once: true
              +     ansible.builtin.set_fact:
              +       k8s_service_host: "{{ hostvars[single_control_plane_name]['ansible_host'] }}"
              +     when: k3s_server['tls-san'] is not defined
              +     delegate_to: localhost
              +   - name: Fetch kubeconfig
              +     when: "'master' in inventory_hostname"
              +     run_once: true
              +     ansible.builtin.fetch:
              +       src: /etc/rancher/k3s/k3s.yaml
              +       dest: ./k3s-kubeconfig.yaml
              +       flat: yes
              +   - name: Update kubeconfig with server address
              +     delegate_to: localhost
              +     run_once: true
              +     become: false
              +     ansible.builtin.lineinfile:
              +       path: ./k3s-kubeconfig.yaml
              +       regexp: "server: https://127.0.0.1:6443"
              +       line: "    server: https://{{ k8s_service_host }}:6443"
              +   - name: Add cilium chart repo
              +     run_once: true
              +     become: false
              +     kubernetes.core.helm_repository:
              +       name: cilium
              +       repo_url: https://helm.cilium.io
              +       force_update: true
              +     delegate_to: localhost
              +     when:
              +     - cilium_check.resources | length == 0
              +     - run_install
              +   - name: Install Cilium
              +     run_once: true
              +     become: false
              +     kubernetes.core.helm:
              +       release_name: cilium
              +       chart_ref: cilium/cilium
              +       chart_version: 1.17.3
              +       namespace: kube-system
              +       create_namespace: false
              +       kubeconfig: ./k3s-kubeconfig.yaml
              +       context: default
              +       values:
              +         kubeProxyReplacement: true
              +         k8sServiceHost: "{{ k8s_service_host }}"
              +         k8sServicePort: 6443
              +         hubble:
              +           enabled: true
              +           relay:
              +             enabled: true
              +           ui:
              +             enabled: true
              +         bgpControlPlane:
              +           enabled: true
              +         ipam:
              +           operator:
              +             clusterPoolIPv4PodCIDRList: [ "{{ k3s_server['cluster-cidr'] }}" ]
              +             clusterPoolIPv4MaskSize: 23
              +     delegate_to: localhost
              +     when:
              +     - cilium_check.resources | length == 0
              +     - run_install
            EOT,
        ]
    }

  # module.tiny_k8s_virtual_machines["hela-tiny-master0"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "200"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-master0"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["hela-tiny-node0"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "220"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-node0"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-master1"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "201"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-master1"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-node1"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "221"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-node1"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-master2"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "202"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-master2"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-node2"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "222"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-node2"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

Plan: 4 to add, 6 to change, 4 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.tiny_k8s_virtual_machines["hela-tiny-master0"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "200"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:22:1C:50",
          - "EE:EE:EE:EE:EE:EE",
          - "66:14:A9:1D:22:0E",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-master0"
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["hela-tiny-node0"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "220"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:91:B7:DC",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "66:B6:0D:3C:31:A8",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-node0"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-master1"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "201"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:22:E4:A3",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "66:89:37:BA:FF:E2",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-master1"
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-node1"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "221"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:DE:E9:1B",
          - "66:D1:CB:FC:86:3F",
          - "EE:EE:EE:EE:EE:EE",
          - "7A:C5:59:90:D6:4A",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-node1"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-master2"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "202"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:8D:F5:D1",
          - "66:C2:8C:3A:2B:66",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-master2"
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-node2"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "222"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:90:65:2A",
          - "66:E0:47:EA:BA:17",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-node2"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":565,"Program":"tfcmt","SHA1":"","Target":"tiny_virtual_machines","Vars":{}} -->